CSI API ETABS v1
cCaseModalHistoryLinear Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cCaseModalHistoryLinear
Public Interface cCaseModalHistoryLinear
Dim instance As cCaseModalHistoryLinear
public interface class cCaseModalHistoryLinear
type cCaseModalHistoryLinear =  interface end
The cCaseModalHistoryLinear type exposes the following members.
Methods
Name | Description
GetLoads
 Retrieves the load data for the specified load case
SetCase
 Initializes a linear modal history analysis case.
SetLoads
Top
See Also
Reference
ETABSv1 Namespace